Полиглоты
Каждый из N школьников некоторой школы знает Mᵢ языков.
Определите, какие языки знают все школьники и языки,
которые знает хотя бы один из школьников.

Формат ввода

Первая строка входных данных содержит количество школьников N.
Далее идет N чисел Mᵢ,
после каждого из чисел идет Mᵢ строк,
содержащих названия языков, которые знает i-й школьник.
Длина названий языков не превышает 1000 символов,
количество различных языков не более 1000. 1≤N≤1000, 1≤Mᵢ≤500.

Формат вывода

В первой строке выведите количество языков, которые знают все школьники.
Начиная со второй строки - список таких языков.
Затем - количество языков, которые знает хотя бы один школьник,
на следующих строках - список таких языков.

Примеры
Тест 1
Входные данные:
3
3
Russian
English
Japanese
2
Russian
English
1
English

Вывод программы:
1
English
3
Russian
Japanese
English


Курбонов Фаррухжон Рауфович     Учащийся    8 месяцев назад
with open('input.txt', 'r', encoding='utf8') as inF:
    line, lines = int(inF.readline()), inF.readlines()
k, c, Sl, Cl = 1, int(lines[0]), [], set()
for i in range(line):
    school = set()
    while k < c + 1:
        school.add(*tuple(lines[k].split()))
        k += 1
    Sl.append(school)
    Cl |= Sl[i]
    Sl[0] &= Sl[i]
    if k < len(lines) - 1:
        c = int(lines[k]) + k
        k += 1
print(len(Sl[0]), *Sl[0], len(Cl), *Cl, sep='\n')

